status/src/2023/1110.org
#+TITLE: 04 November 2023 - 10 November 2023

* MIT OCW
** 18.03sc (differential equations).
*** Unit IV - Matrix Methods: Eigenvalues and Normal Modes
* wood chips
Continuing.
* SCZ Front Step
** Need to take door sill to SJ to clean up
Need to rotate tablesaw to accomodate.
* Abby
** Arch installed
** Slurm install was a PITA
Alder Lake asymmetric P/E cores not well handled by slurm. Probably not
worth it to continue this direction.
* Tuffy
** Arch installed.
* Piper
** Arch installed.
Piper UEFI Bios only allows signed bootloader; so arch and debian 12
installs weren't bootble. Alma Linux would not even install (so centos
stream wasn't even tried). CentOS 7 *was* bootable, so a minimal
installation was kept and uses grub to chain load limine to boot
arch. This may have been luck.  My understanding is that UEFI signed
grub at some point disallowed chain loading unsigned EFI executables
(make sense, really). Definitely a Rube Goldberg arrangement. 50G
bootloader.
* Next arch installs
** M22 (AMD kavari box)
** Various i686
Let's see how the 32 bit version works!
* amdgpu gcn assembly framework started
It's disappointing how poor the compute support is for AMD integrated
GPUs. OpenCL and OpenMP offload both crash X driver on Kiki with
amdgpu driver complaints. Simple GCN assembly example does work, so
this effort somewhat restarts the old kaveri 'kmtrun' concept. Working
example HSA API loader in C++ is being reverse-engineered to nice,
clean, generalized C code.
* quilt block rearrangement
Another 'falling charms' quilt top needs arrangement. The existing
'quilt-block' arranger failed to find a solution, so perhaps it's time
for a high performance simulated annealing approach instead of the
ruby shuffle.
* EPLDH
