status/2023/1110.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-11-18 Sat 05:51 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>04 November 2023 - 10 November 2023</title>
<meta name="author" content="Daniel Kelley" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">04 November 2023 - 10 November 2023</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org2b275fd">1. MIT OCW</a>
<ul>
<li><a href="#org8af6a21">1.1. 18.03sc (differential equations).</a>
<ul>
<li><a href="#org95f8286">1.1.1. Unit IV - Matrix Methods: Eigenvalues and Normal Modes</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org9d0e214">2. wood chips</a></li>
<li><a href="#org46926d6">3. SCZ Front Step</a>
<ul>
<li><a href="#org17f3ce9">3.1. Need to take door sill to SJ to clean up</a></li>
</ul>
</li>
<li><a href="#org138fda0">4. Abby</a>
<ul>
<li><a href="#orgd7dfe5d">4.1. Arch installed</a></li>
<li><a href="#orgb770d7f">4.2. Slurm install was a PITA</a></li>
</ul>
</li>
<li><a href="#orgf5a4665">5. Tuffy</a>
<ul>
<li><a href="#org24ed5ad">5.1. Arch installed.</a></li>
</ul>
</li>
<li><a href="#org18b7938">6. Piper</a>
<ul>
<li><a href="#orga5314d8">6.1. Arch installed.</a></li>
</ul>
</li>
<li><a href="#org66b37cd">7. Next arch installs</a>
<ul>
<li><a href="#org0ecdff3">7.1. M22 (AMD kavari box)</a></li>
<li><a href="#orge168c1f">7.2. Various i686</a></li>
</ul>
</li>
<li><a href="#org3537f79">8. amdgpu gcn assembly framework started</a></li>
<li><a href="#org7b6705a">9. quilt block rearrangement</a></li>
<li><a href="#org89bbc8e">10. EPLDH</a>
<ul>
<li><a href="#org6863d9a">10.1. MPFI interval arithmetic better alternative</a></li>
</ul>
</li>
<li><a href="#org07bde01">11. wktpqb</a>
<ul>
<li><a href="#orgef75f4a">11.1. Verifying edge construction (con't.)</a></li>
<li><a href="#org061ed9d">11.2. 'gcd' algorithm doesn't work</a></li>
</ul>
</li>
<li><a href="#org780e1da">12. Compilers</a>
<ul>
<li><a href="#org8a29680">12.1. Started hand written WSN parser</a></li>
</ul>
</li>
<li><a href="#org8e611fc">13. Mill Controller #2</a>
<ul>
<li><a href="#org7a5e0fb">13.1. Mounted on mill - ready or testing</a></li>
<li><a href="#org18125e0">13.2. Need to investigate new HW/SW for eventual replacements</a>
<ul>
<li><a href="#org2fdd5c1">13.2.1. Old crap ain't gonna last forever</a></li>
<li><a href="#org974df69">13.2.2. Buildroot/Linux 5.15 PREEMPT + latency tools</a></li>
</ul>
</li>
<li><a href="#orgd53661b">13.3. Alternative architecture</a>
<ul>
<li><a href="#orgcd1147b">13.3.1. Split off stepper motor controller to separate board</a></li>
<li><a href="#org422d89c">13.3.2. Use emc2 MODBUS/TCP protocol for stepper and other IO</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org47c9084">14. Alum Rock Data Center</a>
<ul>
<li><a href="#org8ed9053">14.1. Use Arch linux</a></li>
<li><a href="#org325da5a">14.2. Need a VPS with static IP</a>
<ul>
<li><a href="#orga6129e6">14.2.1. OpenVPN to tie it all together</a></li>
<li><a href="#orgdd50c20">14.2.2. Gandi VPS datacenter in France so connection crosses international border</a></li>
<li><a href="#orga08106f">14.2.3. Prototype VPS on existing hardware</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgfb8bd3f">15. CA Root Key Generation</a>
<ul>
<li><a href="#orgf3a9213">15.1. Need to be clear on security properties.</a></li>
<li><a href="#org369cd01">15.2. Simple hardware.</a></li>
<li><a href="#org45d2332">15.3. USB Serial interface only but no credentials across USB I/F.</a></li>
<li><a href="#orgfe9949e">15.4. Use Sneakernet</a></li>
<li><a href="#org16d4927">15.5. Beagleboard</a></li>
<li><a href="#org525e4ec">15.6. LCD Touchscreen</a></li>
<li><a href="#org4e69f01">15.7. Morse code PIN</a></li>
<li><a href="#orgbe2e9f2">15.8. Telephone Keypad or some such</a></li>
<li><a href="#org71a58e1">15.9. Encrypted Filesystem</a></li>
</ul>
</li>
<li><a href="#org2af3775">16. Virtual Orchestra</a>
<ul>
<li><a href="#org22f5165">16.1. sfz file tests</a>
<ul>
<li><a href="#org6ed6217">16.1.1. need tooling to edit sample files</a></li>
</ul>
</li>
<li><a href="#orgc5e09d2">16.2. increasingly skeptical whether quality results are possible</a></li>
<li><a href="#orgbc2625f">16.3. maybe should treat as platform for concatinative synthesis</a></li>
<li><a href="#orge929f31">16.4. maybe should just accept the limitations and work with it</a></li>
</ul>
</li>
<li><a href="#org2293933">17. gat</a>
<ul>
<li><a href="#orgc8a644d">17.1. spectrogram done - matches 'octave' output</a></li>
</ul>
</li>
<li><a href="#org8ddcaa2">18. RIOT drivers</a>
<ul>
<li><a href="#orgd153459">18.1. WS2801</a></li>
<li><a href="#org3ef42f8">18.2. Velleman KA03</a></li>
<li><a href="#orge7b32fe">18.3. Velleman KA05</a></li>
</ul>
</li>
<li><a href="#org0d298fe">19. mcd05 32 button/led box</a>
<ul>
<li><a href="#org436a4fa">19.1. Recovered schematics.</a></li>
<li><a href="#org097e50c">19.2. Planning software.</a></li>
<li><a href="#orga3763cd">19.3. Received STM32F767 Nucleo144 with Ethernet.</a>
<ul>
<li><a href="#org7a5a451">19.3.1. Test program running.</a></li>
<li><a href="#org0633c29">19.3.2. Need to consider CoAP multicast discovery.</a></li>
<li><a href="#org696d10d">19.3.3. Consider simpler architecture with STM32F767 as a 'hub'.</a></li>
<li><a href="#orgc99b150">19.3.4. Consider CAN interface to hub.</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org0ef3b15">20. AMD 2900 bitslice computing</a>
<ul>
<li><a href="#org2a06bea">20.1. Probably my oldest uncompleted project</a></li>
<li><a href="#org6380348">20.2. Exploring possibilities for something constructive</a></li>
</ul>
</li>
<li><a href="#org0da5ce1">21. Hitachi HD68B09E CPU</a>
<ul>
<li><a href="#orgd3b3ced">21.1. RAM/UART/IO</a></li>
<li><a href="#orgb7188c4">21.2. Started schematic</a>
<ul>
<li><a href="#org820e2ef">21.2.1. Standard peripheral set for 8 bit CPU bringups</a></li>
</ul>
</li>
<li><a href="#orgfd4adf3">21.3. Arduino Mega 2560 DMA loader</a></li>
<li><a href="#org029b140">21.4. Generate quadrature clock directly</a></li>
<li><a href="#org5266c37">21.5. Full Bus SW Emulation infeasible</a></li>
</ul>
</li>
<li><a href="#org78bbd14">22. Rockwell R65F11</a>
<ul>
<li><a href="#orge6504cc">22.1. Still evaluating.</a></li>
<li><a href="#org26e76fc">22.2. Dev board</a></li>
</ul>
</li>
<li><a href="#org4c4aa07">23. PLD programming</a></li>
<li><a href="#org02ebf51">24. EPROM Programming</a></li>
<li><a href="#org58236dc">25. POSIT</a>
<ul>
<li><a href="#orgb19dbf0">25.1. Use POSITs for YRX?</a></li>
</ul>
</li>
<li><a href="#orgbb94846">26. MAME</a>
<ul>
<li><a href="#org1d098c8">26.1. Subset builds in debug mode</a></li>
<li><a href="#orgf73d8d1">26.2. gs6809 serial IO doesn't work right with PTY and other streams</a></li>
<li><a href="#org821cd54">26.3. ampro (Z80/Z80SIO) <b>does</b> work with PTY</a></li>
<li><a href="#org6c4e1cd">26.4. Evaluating what is needed for other emulators.</a></li>
</ul>
</li>
<li><a href="#orgab4b351">27. More project ideas</a>
<ul>
<li><a href="#org6048dd4">27.1. Zuse Z3 simulation in Verilog</a></li>
<li><a href="#org9c9e113">27.2. GMPForth ports to simulators</a>
<ul>
<li><a href="#org81ec4f8">27.2.1. SIMH for some targets (vax)</a></li>
<li><a href="#orga29d4cd">27.2.2. MAME looks interesting for microprocessor system emulations</a></li>
<li><a href="#org4ae8935">27.2.3. Ports to classic figFORTH targets</a></li>
</ul>
</li>
<li><a href="#orgf350df3">27.3. GMPASM assembler</a></li>
<li><a href="#org680135c">27.4. Extracting ISO Superboard Forth ROMS for MAME emulation</a></li>
<li><a href="#org93d5754">27.5. 'bwocl' OpenCL tooling</a>
<ul>
<li><a href="#orgcb6fb90">27.5.1. Offline compilation</a></li>
<li><a href="#org3094b0b">27.5.2. Standard Kernel Running</a></li>
</ul>
</li>
<li><a href="#org159a963">27.6. hardware support for classic 5V CPUs</a>
<ul>
<li><a href="#orgc8b34c8">27.6.1. RTX2000, CDP1802 still available!</a></li>
<li><a href="#orga6bfddf">27.6.2. 6502, 68000, 320C30, others on hand</a></li>
<li><a href="#orgb5f2ba9">27.6.3. CPUs with totally async bus may be supportable without RAM</a></li>
<li><a href="#orgebb9c45">27.6.4. Could use small footprint monitor in asm (gmpmon?)</a></li>
</ul>
</li>
<li><a href="#org5ff3229">27.7. Existing 'retro' hardware still working?</a>
<ul>
<li><a href="#orgce939a4">27.7.1. OSI Superboard</a></li>
<li><a href="#orge9ce51b">27.7.2. Super Jolt</a></li>
<li><a href="#orga081665">27.7.3. Ampro Little Board</a></li>
<li><a href="#org6efac16">27.7.4. Rockwell R65F11 Demo board</a></li>
<li><a href="#orgbd256e7">27.7.5. NMIX-0016</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org06f613e">28. David Davies</a>
<ul>
<li><a href="#org2b08587">28.1. Broadcom BCG? Employee indicted for running a brothel.</a></li>
<li><a href="#org865d535">28.2. New case C1923172, consolidated with <b>15</b> Parties.</a></li>
<li><a href="#org42ee720">28.3. Next hearing 2/26/2024</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org2b275fd" class="outline-2">
<h2 id="org2b275fd"><span class="section-number-2">1.</span> MIT OCW</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org8af6a21" class="outline-3">
<h3 id="org8af6a21"><span class="section-number-3">1.1.</span> 18.03sc (differential equations).</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-org95f8286" class="outline-4">
<h4 id="org95f8286"><span class="section-number-4">1.1.1.</span> Unit IV - Matrix Methods: Eigenvalues and Normal Modes</h4>
</div>
</div>
</div>
<div id="outline-container-org9d0e214" class="outline-2">
<h2 id="org9d0e214"><span class="section-number-2">2.</span> wood chips</h2>
<div class="outline-text-2" id="text-2">
<p>
Continuing.
</p>
</div>
</div>
<div id="outline-container-org46926d6" class="outline-2">
<h2 id="org46926d6"><span class="section-number-2">3.</span> SCZ Front Step</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org17f3ce9" class="outline-3">
<h3 id="org17f3ce9"><span class="section-number-3">3.1.</span> Need to take door sill to SJ to clean up</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Need to rotate tablesaw to accomodate.
</p>
</div>
</div>
</div>
<div id="outline-container-org138fda0" class="outline-2">
<h2 id="org138fda0"><span class="section-number-2">4.</span> Abby</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orgd7dfe5d" class="outline-3">
<h3 id="orgd7dfe5d"><span class="section-number-3">4.1.</span> Arch installed</h3>
</div>
<div id="outline-container-orgb770d7f" class="outline-3">
<h3 id="orgb770d7f"><span class="section-number-3">4.2.</span> Slurm install was a PITA</h3>
<div class="outline-text-3" id="text-4-2">
<p>
Alder Lake asymmetric P/E cores not well handled by slurm. Probably not
worth it to continue this direction.
</p>
</div>
</div>
</div>
<div id="outline-container-orgf5a4665" class="outline-2">
<h2 id="orgf5a4665"><span class="section-number-2">5.</span> Tuffy</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org24ed5ad" class="outline-3">
<h3 id="org24ed5ad"><span class="section-number-3">5.1.</span> Arch installed.</h3>
</div>
</div>
<div id="outline-container-org18b7938" class="outline-2">
<h2 id="org18b7938"><span class="section-number-2">6.</span> Piper</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-orga5314d8" class="outline-3">
<h3 id="orga5314d8"><span class="section-number-3">6.1.</span> Arch installed.</h3>
<div class="outline-text-3" id="text-6-1">
<p>
Piper UEFI Bios only allows signed bootloader; so arch and debian 12
installs weren't bootble. Alma Linux would not even install (so centos
stream wasn't even tried). CentOS 7 <b>was</b> bootable, so a minimal
installation was kept and uses grub to chain load limine to boot
arch. This may have been luck.  My understanding is that UEFI signed
grub at some point disallowed chain loading unsigned EFI executables
(make sense, really). Definitely a Rube Goldberg arrangement. 50G
bootloader.
</p>
</div>
</div>
</div>
<div id="outline-container-org66b37cd" class="outline-2">
<h2 id="org66b37cd"><span class="section-number-2">7.</span> Next arch installs</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-org0ecdff3" class="outline-3">
<h3 id="org0ecdff3"><span class="section-number-3">7.1.</span> M22 (AMD kavari box)</h3>
</div>
<div id="outline-container-orge168c1f" class="outline-3">
<h3 id="orge168c1f"><span class="section-number-3">7.2.</span> Various i686</h3>
<div class="outline-text-3" id="text-7-2">
<p>
Let's see how the 32 bit version works!
</p>
</div>
</div>
</div>
<div id="outline-container-org3537f79" class="outline-2">
<h2 id="org3537f79"><span class="section-number-2">8.</span> amdgpu gcn assembly framework started</h2>
<div class="outline-text-2" id="text-8">
<p>
It's disappointing how poor the compute support is for AMD integrated
GPUs. OpenCL and OpenMP offload both crash X driver on Kiki with
amdgpu driver complaints. Simple GCN assembly example does work, so
this effort somewhat restarts the old kaveri 'kmtrun' concept. Working
example HSA API loader in C++ is being reverse-engineered to nice,
clean, generalized C code.
</p>
</div>
</div>
<div id="outline-container-org7b6705a" class="outline-2">
<h2 id="org7b6705a"><span class="section-number-2">9.</span> quilt block rearrangement</h2>
<div class="outline-text-2" id="text-9">
<p>
Another 'falling charms' quilt top needs arrangement. The existing
'quilt-block' arranger failed to find a solution, so perhaps it's time
for a high performance simulated annealing approach instead of the
ruby shuffle.
</p>
</div>
</div>
