status/src/2023/1110.org
** MPFI interval arithmetic better alternative
* wktpqb
** Verifying edge construction (con't.)
** 'gcd' algorithm doesn't work
* Compilers
** Started hand written WSN parser
* Mill Controller #2
** Mounted on mill - ready or testing
** Need to investigate new HW/SW for eventual replacements
*** Old crap ain't gonna last forever
*** Buildroot/Linux 5.15 PREEMPT + latency tools
First pass done - boots on real hardware
** Alternative architecture
*** Split off stepper motor controller to separate board
Increase latency tolerance on controller
*** Use emc2 MODBUS/TCP protocol for stepper and other IO
* Alum Rock Data Center
** Use Arch linux
Thanks to niece Danielle for consultation.
** Need a VPS with static IP
*** OpenVPN to tie it all together
*** Gandi VPS datacenter in France so connection crosses international border
What are the data security and privacy tradeoffs?
*** Prototype VPS on existing hardware
**** OpenStack?
* CA Root Key Generation
Nice to have an appliance that manages keys.
Could just buy something from nitrokey https://www.nitrokey.com/
** Need to be clear on security properties.
Definitely protect against remote access to private keys. How strong
does the protection against *local* access need to be?
** Simple hardware.
** USB Serial interface only but no credentials across USB I/F.
But this potentially exposes the hardware to remote access via the USB
I/F when connected.
** Use Sneakernet
Using "disk drive" IO introduces air gap - remote access *impossible*.
Increases attack surface via filesystem manipulation. But use signed
requests, so attacks would have to be insider requests.
** Beagleboard
Found in SCZ. Thought it was in SJ.
** LCD Touchscreen
Unlocks encrypted filesystem. Maybe not needed. See below.
** Morse code PIN
Only need ONE button, and a pass/fail LED. Hardware will never go EOL
(Thanks Elena!). Susceptible to remote audio recording of PIN button
noise, which could be overcome by using 2FA. Again - what am I
protecting against?
** Telephone Keypad or some such
May be more straightforward.
** Encrypted Filesystem
For sensitive material only.
* Virtual Orchestra
** sfz file tests
*** need tooling to edit sample files
** increasingly skeptical whether quality results are possible
** maybe should treat as platform for concatinative synthesis
** maybe should just accept the limitations and work with it
One should not be disappointed that a guitar can't sound like a flute.
* gat
** spectrogram done - matches 'octave' output
* RIOT drivers
Implemented - needs testing.
** WS2801
** Velleman KA03
** Velleman KA05
* mcd05 32 button/led box
** Recovered schematics.
** Planning software.
** Received STM32F767 Nucleo144 with Ethernet.
*** Test program running.
*** Need to consider CoAP multicast discovery.
*** Consider simpler architecture with STM32F767 as a 'hub'.
*** Consider CAN interface to hub.
* AMD 2900 bitslice computing
** Probably my oldest uncompleted project
** Exploring possibilities for something constructive
Create verilog models for 2903/2910 and verify against hardware?
* Hitachi HD68B09E CPU
** RAM/UART/IO
** Started schematic
