status/2023/1110.html
<div id="outline-container-org89bbc8e" class="outline-2">
<h2 id="org89bbc8e"><span class="section-number-2">10.</span> EPLDH</h2>
<div class="outline-text-2" id="text-10">
</div>
<div id="outline-container-org6863d9a" class="outline-3">
<h3 id="org6863d9a"><span class="section-number-3">10.1.</span> MPFI interval arithmetic better alternative</h3>
</div>
</div>
<div id="outline-container-org07bde01" class="outline-2">
<h2 id="org07bde01"><span class="section-number-2">11.</span> wktpqb</h2>
<div class="outline-text-2" id="text-11">
</div>
<div id="outline-container-orgef75f4a" class="outline-3">
<h3 id="orgef75f4a"><span class="section-number-3">11.1.</span> Verifying edge construction (con't.)</h3>
</div>
<div id="outline-container-org061ed9d" class="outline-3">
<h3 id="org061ed9d"><span class="section-number-3">11.2.</span> 'gcd' algorithm doesn't work</h3>
</div>
</div>
<div id="outline-container-org780e1da" class="outline-2">
<h2 id="org780e1da"><span class="section-number-2">12.</span> Compilers</h2>
<div class="outline-text-2" id="text-12">
</div>
<div id="outline-container-org8a29680" class="outline-3">
<h3 id="org8a29680"><span class="section-number-3">12.1.</span> Started hand written WSN parser</h3>
</div>
</div>
<div id="outline-container-org8e611fc" class="outline-2">
<h2 id="org8e611fc"><span class="section-number-2">13.</span> Mill Controller #2</h2>
<div class="outline-text-2" id="text-13">
</div>
<div id="outline-container-org7a5e0fb" class="outline-3">
<h3 id="org7a5e0fb"><span class="section-number-3">13.1.</span> Mounted on mill - ready or testing</h3>
</div>
<div id="outline-container-org18125e0" class="outline-3">
<h3 id="org18125e0"><span class="section-number-3">13.2.</span> Need to investigate new HW/SW for eventual replacements</h3>
<div class="outline-text-3" id="text-13-2">
</div>
<div id="outline-container-org2fdd5c1" class="outline-4">
<h4 id="org2fdd5c1"><span class="section-number-4">13.2.1.</span> Old crap ain't gonna last forever</h4>
</div>
<div id="outline-container-org974df69" class="outline-4">
<h4 id="org974df69"><span class="section-number-4">13.2.2.</span> Buildroot/Linux 5.15 PREEMPT + latency tools</h4>
<div class="outline-text-4" id="text-13-2-2">
<p>
First pass done - boots on real hardware
</p>
</div>
</div>
</div>
<div id="outline-container-orgd53661b" class="outline-3">
<h3 id="orgd53661b"><span class="section-number-3">13.3.</span> Alternative architecture</h3>
<div class="outline-text-3" id="text-13-3">
</div>
<div id="outline-container-orgcd1147b" class="outline-4">
<h4 id="orgcd1147b"><span class="section-number-4">13.3.1.</span> Split off stepper motor controller to separate board</h4>
<div class="outline-text-4" id="text-13-3-1">
<p>
Increase latency tolerance on controller
</p>
</div>
</div>
<div id="outline-container-org422d89c" class="outline-4">
<h4 id="org422d89c"><span class="section-number-4">13.3.2.</span> Use emc2 MODBUS/TCP protocol for stepper and other IO</h4>
</div>
</div>
</div>
<div id="outline-container-org47c9084" class="outline-2">
<h2 id="org47c9084"><span class="section-number-2">14.</span> Alum Rock Data Center</h2>
<div class="outline-text-2" id="text-14">
</div>
<div id="outline-container-org8ed9053" class="outline-3">
<h3 id="org8ed9053"><span class="section-number-3">14.1.</span> Use Arch linux</h3>
<div class="outline-text-3" id="text-14-1">
<p>
Thanks to niece Danielle for consultation.
</p>
</div>
</div>
<div id="outline-container-org325da5a" class="outline-3">
<h3 id="org325da5a"><span class="section-number-3">14.2.</span> Need a VPS with static IP</h3>
<div class="outline-text-3" id="text-14-2">
</div>
<div id="outline-container-orga6129e6" class="outline-4">
<h4 id="orga6129e6"><span class="section-number-4">14.2.1.</span> OpenVPN to tie it all together</h4>
</div>
<div id="outline-container-orgdd50c20" class="outline-4">
<h4 id="orgdd50c20"><span class="section-number-4">14.2.2.</span> Gandi VPS datacenter in France so connection crosses international border</h4>
<div class="outline-text-4" id="text-14-2-2">
<p>
What are the data security and privacy tradeoffs?
</p>
</div>
</div>
<div id="outline-container-orga08106f" class="outline-4">
<h4 id="orga08106f"><span class="section-number-4">14.2.3.</span> Prototype VPS on existing hardware</h4>
<div class="outline-text-4" id="text-14-2-3">
</div>
<ol class="org-ol">
<li><a id="org5b09921"></a>OpenStack?<br /></li>
</ol>
</div>
</div>
</div>
<div id="outline-container-orgfb8bd3f" class="outline-2">
<h2 id="orgfb8bd3f"><span class="section-number-2">15.</span> CA Root Key Generation</h2>
<div class="outline-text-2" id="text-15">
<p>
Nice to have an appliance that manages keys.
Could just buy something from nitrokey <a href="https://www.nitrokey.com/">https://www.nitrokey.com/</a>
</p>
</div>
<div id="outline-container-orgf3a9213" class="outline-3">
<h3 id="orgf3a9213"><span class="section-number-3">15.1.</span> Need to be clear on security properties.</h3>
<div class="outline-text-3" id="text-15-1">
<p>
Definitely protect against remote access to private keys. How strong
does the protection against <b>local</b> access need to be?
</p>
</div>
</div>
<div id="outline-container-org369cd01" class="outline-3">
<h3 id="org369cd01"><span class="section-number-3">15.2.</span> Simple hardware.</h3>
</div>
<div id="outline-container-org45d2332" class="outline-3">
<h3 id="org45d2332"><span class="section-number-3">15.3.</span> USB Serial interface only but no credentials across USB I/F.</h3>
<div class="outline-text-3" id="text-15-3">
<p>
But this potentially exposes the hardware to remote access via the USB
I/F when connected.
</p>
</div>
</div>
<div id="outline-container-orgfe9949e" class="outline-3">
<h3 id="orgfe9949e"><span class="section-number-3">15.4.</span> Use Sneakernet</h3>
<div class="outline-text-3" id="text-15-4">
<p>
Using "disk drive" IO introduces air gap - remote access <b>impossible</b>.
Increases attack surface via filesystem manipulation. But use signed
requests, so attacks would have to be insider requests.
</p>
</div>
</div>
<div id="outline-container-org16d4927" class="outline-3">
<h3 id="org16d4927"><span class="section-number-3">15.5.</span> Beagleboard</h3>
<div class="outline-text-3" id="text-15-5">
<p>
Found in SCZ. Thought it was in SJ.
</p>
</div>
</div>
<div id="outline-container-org525e4ec" class="outline-3">
<h3 id="org525e4ec"><span class="section-number-3">15.6.</span> LCD Touchscreen</h3>
<div class="outline-text-3" id="text-15-6">
<p>
Unlocks encrypted filesystem. Maybe not needed. See below.
</p>
</div>
</div>
<div id="outline-container-org4e69f01" class="outline-3">
<h3 id="org4e69f01"><span class="section-number-3">15.7.</span> Morse code PIN</h3>
<div class="outline-text-3" id="text-15-7">
<p>
Only need ONE button, and a pass/fail LED. Hardware will never go EOL
(Thanks Elena!). Susceptible to remote audio recording of PIN button
noise, which could be overcome by using 2FA. Again - what am I
protecting against?
</p>
</div>
</div>
<div id="outline-container-orgbe2e9f2" class="outline-3">
<h3 id="orgbe2e9f2"><span class="section-number-3">15.8.</span> Telephone Keypad or some such</h3>
<div class="outline-text-3" id="text-15-8">
<p>
May be more straightforward.
</p>
</div>
</div>
<div id="outline-container-org71a58e1" class="outline-3">
<h3 id="org71a58e1"><span class="section-number-3">15.9.</span> Encrypted Filesystem</h3>
<div class="outline-text-3" id="text-15-9">
<p>
For sensitive material only.
</p>
</div>
</div>
</div>
<div id="outline-container-org2af3775" class="outline-2">
<h2 id="org2af3775"><span class="section-number-2">16.</span> Virtual Orchestra</h2>
<div class="outline-text-2" id="text-16">
</div>
<div id="outline-container-org22f5165" class="outline-3">
<h3 id="org22f5165"><span class="section-number-3">16.1.</span> sfz file tests</h3>
<div class="outline-text-3" id="text-16-1">
</div>
<div id="outline-container-org6ed6217" class="outline-4">
<h4 id="org6ed6217"><span class="section-number-4">16.1.1.</span> need tooling to edit sample files</h4>
</div>
</div>
<div id="outline-container-orgc5e09d2" class="outline-3">
<h3 id="orgc5e09d2"><span class="section-number-3">16.2.</span> increasingly skeptical whether quality results are possible</h3>
</div>
<div id="outline-container-orgbc2625f" class="outline-3">
<h3 id="orgbc2625f"><span class="section-number-3">16.3.</span> maybe should treat as platform for concatinative synthesis</h3>
</div>
<div id="outline-container-orge929f31" class="outline-3">
<h3 id="orge929f31"><span class="section-number-3">16.4.</span> maybe should just accept the limitations and work with it</h3>
<div class="outline-text-3" id="text-16-4">
<p>
One should not be disappointed that a guitar can't sound like a flute.
</p>
</div>
</div>
</div>
<div id="outline-container-org2293933" class="outline-2">
<h2 id="org2293933"><span class="section-number-2">17.</span> gat</h2>
<div class="outline-text-2" id="text-17">
</div>
<div id="outline-container-orgc8a644d" class="outline-3">
<h3 id="orgc8a644d"><span class="section-number-3">17.1.</span> spectrogram done - matches 'octave' output</h3>
</div>
</div>
<div id="outline-container-org8ddcaa2" class="outline-2">
<h2 id="org8ddcaa2"><span class="section-number-2">18.</span> RIOT drivers</h2>
<div class="outline-text-2" id="text-18">
<p>
Implemented - needs testing.
</p>
</div>
<div id="outline-container-orgd153459" class="outline-3">
<h3 id="orgd153459"><span class="section-number-3">18.1.</span> WS2801</h3>
</div>
<div id="outline-container-org3ef42f8" class="outline-3">
<h3 id="org3ef42f8"><span class="section-number-3">18.2.</span> Velleman KA03</h3>
</div>
<div id="outline-container-orge7b32fe" class="outline-3">
<h3 id="orge7b32fe"><span class="section-number-3">18.3.</span> Velleman KA05</h3>
</div>
</div>
<div id="outline-container-org0d298fe" class="outline-2">
<h2 id="org0d298fe"><span class="section-number-2">19.</span> mcd05 32 button/led box</h2>
<div class="outline-text-2" id="text-19">
</div>
<div id="outline-container-org436a4fa" class="outline-3">
<h3 id="org436a4fa"><span class="section-number-3">19.1.</span> Recovered schematics.</h3>
</div>
<div id="outline-container-org097e50c" class="outline-3">
<h3 id="org097e50c"><span class="section-number-3">19.2.</span> Planning software.</h3>
</div>
<div id="outline-container-orga3763cd" class="outline-3">
<h3 id="orga3763cd"><span class="section-number-3">19.3.</span> Received STM32F767 Nucleo144 with Ethernet.</h3>
<div class="outline-text-3" id="text-19-3">
</div>
<div id="outline-container-org7a5a451" class="outline-4">
<h4 id="org7a5a451"><span class="section-number-4">19.3.1.</span> Test program running.</h4>
</div>
<div id="outline-container-org0633c29" class="outline-4">
<h4 id="org0633c29"><span class="section-number-4">19.3.2.</span> Need to consider CoAP multicast discovery.</h4>
</div>
<div id="outline-container-org696d10d" class="outline-4">
<h4 id="org696d10d"><span class="section-number-4">19.3.3.</span> Consider simpler architecture with STM32F767 as a 'hub'.</h4>
</div>
<div id="outline-container-orgc99b150" class="outline-4">
<h4 id="orgc99b150"><span class="section-number-4">19.3.4.</span> Consider CAN interface to hub.</h4>
</div>
</div>
</div>
<div id="outline-container-org0ef3b15" class="outline-2">
<h2 id="org0ef3b15"><span class="section-number-2">20.</span> AMD 2900 bitslice computing</h2>
<div class="outline-text-2" id="text-20">
</div>
<div id="outline-container-org2a06bea" class="outline-3">
<h3 id="org2a06bea"><span class="section-number-3">20.1.</span> Probably my oldest uncompleted project</h3>
</div>
<div id="outline-container-org6380348" class="outline-3">
<h3 id="org6380348"><span class="section-number-3">20.2.</span> Exploring possibilities for something constructive</h3>
<div class="outline-text-3" id="text-20-2">
<p>
Create verilog models for 2903/2910 and verify against hardware?
</p>
</div>
</div>
</div>
<div id="outline-container-org0da5ce1" class="outline-2">
<h2 id="org0da5ce1"><span class="section-number-2">21.</span> Hitachi HD68B09E CPU</h2>
<div class="outline-text-2" id="text-21">
</div>
<div id="outline-container-orgd3b3ced" class="outline-3">
<h3 id="orgd3b3ced"><span class="section-number-3">21.1.</span> RAM/UART/IO</h3>
</div>
<div id="outline-container-orgb7188c4" class="outline-3">
<h3 id="orgb7188c4"><span class="section-number-3">21.2.</span> Started schematic</h3>
<div class="outline-text-3" id="text-21-2">
</div>
