status/2023/1110.html
<div id="outline-container-org820e2ef" class="outline-4">
<h4 id="org820e2ef"><span class="section-number-4">21.2.1.</span> Standard peripheral set for 8 bit CPU bringups</h4>
<div class="outline-text-4" id="text-21-2-1">
<p>
Board schematic planned - need Kicad symbols
</p>
</div>
</div>
</div>
<div id="outline-container-orgfd4adf3" class="outline-3">
<h3 id="orgfd4adf3"><span class="section-number-3">21.3.</span> Arduino Mega 2560 DMA loader</h3>
<div class="outline-text-3" id="text-21-3">
<p>
&#x2026;Along with standard 8 bit loader
</p>
</div>
</div>
<div id="outline-container-org029b140" class="outline-3">
<h3 id="org029b140"><span class="section-number-3">21.4.</span> Generate quadrature clock directly</h3>
</div>
<div id="outline-container-org5266c37" class="outline-3">
<h3 id="org5266c37"><span class="section-number-3">21.5.</span> Full Bus SW Emulation infeasible</h3>
<div class="outline-text-3" id="text-21-5">
<p>
6809 1000ns maximum cycle time too short
</p>
</div>
</div>
</div>
<div id="outline-container-org78bbd14" class="outline-2">
<h2 id="org78bbd14"><span class="section-number-2">22.</span> Rockwell R65F11</h2>
<div class="outline-text-2" id="text-22">
</div>
<div id="outline-container-orge6504cc" class="outline-3">
<h3 id="orge6504cc"><span class="section-number-3">22.1.</span> Still evaluating.</h3>
</div>
<div id="outline-container-org26e76fc" class="outline-3">
<h3 id="org26e76fc"><span class="section-number-3">22.2.</span> Dev board</h3>
<div class="outline-text-3" id="text-22-2">
<p>
Reverse engineered some of a mostly fully built development board with
one part missing. As near as I can tell, that one part is some sort of
programmable address decoder with a pinout that does not correspond to
any part I can find. Kind of like a GAL but with inputs on top and
outputs on bottom (as opposed to left and right in a standard GAL). I
have no idea what the provenance of this board is and if it ever
worked.
</p>
</div>
</div>
</div>
<div id="outline-container-org4c4aa07" class="outline-2">
<h2 id="org4c4aa07"><span class="section-number-2">23.</span> PLD programming</h2>
<div class="outline-text-2" id="text-23">
<p>
Looks like Atmel 16V8 is the last 5V PLD part left standing. Maybe not
surprising that there still doesn't appear to be a fully open source
tool chain for programming. How hard could it be? (!) Could next-pnr
generic help? Might be easier to use espresso for logic array and program
output logic bits directly for simple stuff.
</p>
</div>
</div>
<div id="outline-container-org02ebf51" class="outline-2">
<h2 id="org02ebf51"><span class="section-number-2">24.</span> EPROM Programming</h2>
<div class="outline-text-2" id="text-24">
<p>
Found some software for Needham programmer. Need to check electrolytic
caps on ISA board.
</p>
</div>
</div>
<div id="outline-container-org58236dc" class="outline-2">
<h2 id="org58236dc"><span class="section-number-2">25.</span> POSIT</h2>
<div class="outline-text-2" id="text-25">
</div>
<div id="outline-container-orgb19dbf0" class="outline-3">
<h3 id="orgb19dbf0"><span class="section-number-3">25.1.</span> Use POSITs for YRX?</h3>
<div class="outline-text-3" id="text-25-1">
<p>
No. Existing library is fine.
</p>
</div>
</div>
</div>
<div id="outline-container-orgbb94846" class="outline-2">
<h2 id="orgbb94846"><span class="section-number-2">26.</span> MAME</h2>
<div class="outline-text-2" id="text-26">
</div>
<div id="outline-container-org1d098c8" class="outline-3">
<h3 id="org1d098c8"><span class="section-number-3">26.1.</span> Subset builds in debug mode</h3>
<div class="outline-text-3" id="text-26-1">
<p>
Full debug fails - not enough disk or memory.
</p>
</div>
</div>
<div id="outline-container-orgf73d8d1" class="outline-3">
<h3 id="orgf73d8d1"><span class="section-number-3">26.2.</span> gs6809 serial IO doesn't work right with PTY and other streams</h3>
</div>
<div id="outline-container-org821cd54" class="outline-3">
<h3 id="org821cd54"><span class="section-number-3">26.3.</span> ampro (Z80/Z80SIO) <b>does</b> work with PTY</h3>
</div>
<div id="outline-container-org6c4e1cd" class="outline-3">
<h3 id="org6c4e1cd"><span class="section-number-3">26.4.</span> Evaluating what is needed for other emulators.</h3>
</div>
</div>
<div id="outline-container-orgab4b351" class="outline-2">
<h2 id="orgab4b351"><span class="section-number-2">27.</span> More project ideas</h2>
<div class="outline-text-2" id="text-27">
</div>
<div id="outline-container-org6048dd4" class="outline-3">
<h3 id="org6048dd4"><span class="section-number-3">27.1.</span> Zuse Z3 simulation in Verilog</h3>
<div class="outline-text-3" id="text-27-1">
<p>
Good excuse for floating point ALU design. Try posit format?
</p>
</div>
</div>
<div id="outline-container-org9c9e113" class="outline-3">
<h3 id="org9c9e113"><span class="section-number-3">27.2.</span> GMPForth ports to simulators</h3>
<div class="outline-text-3" id="text-27-2">
</div>
<div id="outline-container-org81ec4f8" class="outline-4">
<h4 id="org81ec4f8"><span class="section-number-4">27.2.1.</span> SIMH for some targets (vax)</h4>
</div>
<div id="outline-container-orga29d4cd" class="outline-4">
<h4 id="orga29d4cd"><span class="section-number-4">27.2.2.</span> MAME looks interesting for microprocessor system emulations</h4>
<div class="outline-text-4" id="text-27-2-2">
<p>
How to support ersatz systems?
</p>
</div>
</div>
<div id="outline-container-org4ae8935" class="outline-4">
<h4 id="org4ae8935"><span class="section-number-4">27.2.3.</span> Ports to classic figFORTH targets</h4>
</div>
</div>
<div id="outline-container-orgf350df3" class="outline-3">
<h3 id="orgf350df3"><span class="section-number-3">27.3.</span> GMPASM assembler</h3>
<div class="outline-text-3" id="text-27-3">
<p>
May be useful for handbuilt and rare systems (DMX1000?).
</p>
</div>
</div>
<div id="outline-container-org680135c" class="outline-3">
<h3 id="org680135c"><span class="section-number-3">27.4.</span> Extracting ISO Superboard Forth ROMS for MAME emulation</h3>
</div>
<div id="outline-container-org93d5754" class="outline-3">
<h3 id="org93d5754"><span class="section-number-3">27.5.</span> 'bwocl' OpenCL tooling</h3>
<div class="outline-text-3" id="text-27-5">
</div>
<div id="outline-container-orgcb6fb90" class="outline-4">
<h4 id="orgcb6fb90"><span class="section-number-4">27.5.1.</span> Offline compilation</h4>
</div>
<div id="outline-container-org3094b0b" class="outline-4">
<h4 id="org3094b0b"><span class="section-number-4">27.5.2.</span> Standard Kernel Running</h4>
</div>
</div>
<div id="outline-container-org159a963" class="outline-3">
<h3 id="org159a963"><span class="section-number-3">27.6.</span> hardware support for classic 5V CPUs</h3>
<div class="outline-text-3" id="text-27-6">
</div>
<div id="outline-container-orgc8b34c8" class="outline-4">
<h4 id="orgc8b34c8"><span class="section-number-4">27.6.1.</span> RTX2000, CDP1802 still available!</h4>
</div>
<div id="outline-container-orga6bfddf" class="outline-4">
<h4 id="orga6bfddf"><span class="section-number-4">27.6.2.</span> 6502, 68000, 320C30, others on hand</h4>
</div>
<div id="outline-container-orgb5f2ba9" class="outline-4">
<h4 id="orgb5f2ba9"><span class="section-number-4">27.6.3.</span> CPUs with totally async bus may be supportable without RAM</h4>
</div>
<div id="outline-container-orgebb9c45" class="outline-4">
<h4 id="orgebb9c45"><span class="section-number-4">27.6.4.</span> Could use small footprint monitor in asm (gmpmon?)</h4>
</div>
</div>
<div id="outline-container-org5ff3229" class="outline-3">
<h3 id="org5ff3229"><span class="section-number-3">27.7.</span> Existing 'retro' hardware still working?</h3>
<div class="outline-text-3" id="text-27-7">
</div>
<div id="outline-container-orgce939a4" class="outline-4">
<h4 id="orgce939a4"><span class="section-number-4">27.7.1.</span> OSI Superboard</h4>
<div class="outline-text-4" id="text-27-7-1">
<p>
Unknown. Composite to VGA adapter didn't seem to work. Needs analysis.
Found OSI model 610 board underneath!
</p>
</div>
</div>
<div id="outline-container-orge9ce51b" class="outline-4">
<h4 id="orge9ce51b"><span class="section-number-4">27.7.2.</span> Super Jolt</h4>
<div class="outline-text-4" id="text-27-7-2">
<p>
No output. Needs analysis.
</p>
</div>
</div>
<div id="outline-container-orga081665" class="outline-4">
<h4 id="orga081665"><span class="section-number-4">27.7.3.</span> Ampro Little Board</h4>
<div class="outline-text-4" id="text-27-7-3">
<p>
Not booting. Needs analysis.
</p>
</div>
</div>
<div id="outline-container-org6efac16" class="outline-4">
<h4 id="org6efac16"><span class="section-number-4">27.7.4.</span> Rockwell R65F11 Demo board</h4>
<div class="outline-text-4" id="text-27-7-4">
<p>
UART sending "NO ROM" at 2400 7N1 as expected with 2MHz xtal.
MAME emulator possibilities?
</p>
</div>
</div>
<div id="outline-container-orgbd256e7" class="outline-4">
<h4 id="orgbd256e7"><span class="section-number-4">27.7.5.</span> NMIX-0016</h4>
<div class="outline-text-4" id="text-27-7-5">
<p>
Works. Found original prom in a parts stash(!).
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-org06f613e" class="outline-2">
<h2 id="org06f613e"><span class="section-number-2">28.</span> David Davies</h2>
<div class="outline-text-2" id="text-28">
</div>
<div id="outline-container-org2b08587" class="outline-3">
<h3 id="org2b08587"><span class="section-number-3">28.1.</span> Broadcom BCG? Employee indicted for running a brothel.</h3>
</div>
<div id="outline-container-org865d535" class="outline-3">
<h3 id="org865d535"><span class="section-number-3">28.2.</span> New case C1923172, consolidated with <b>15</b> Parties.</h3>
</div>
<div id="outline-container-org42ee720" class="outline-3">
<h3 id="org42ee720"><span class="section-number-3">28.3.</span> Next hearing 2/26/2024</h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Daniel Kelley</p>
<p class="date">Created: 2023-11-18 Sat 05:51</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>